In [2]:
import pandas as pd
df=pd.read_csv(r"C:\Users\HP\Downloads\TEMP.csv")
df

   Temperature  Humidity       city
0           34        50  Hyderabad
1           24        45  Hyderabad
2           34        36  Hyderabad
3           12        56  Hyderabad
4           67        78  Hyderabad
5           78        89    Chennai
6           89        78    Chennai

In [2]:
df.isnull()

   Temperature  Humidity   city
0        False     False  False
1        False     False  False
2        False     False  False
3        False     False  False
4        False     False  False
5        False     False  False
6        False     False  False

# exploring data

In [3]:
df.head()

   Temperature  Humidity       city
0           34        50  Hyderabad
1           24        45  Hyderabad
2           34        36  Hyderabad
3           12        56  Hyderabad
4           67        78  Hyderabad

In [3]:
df.tail()

   Temperature  Humidity       city
2           34        36  Hyderabad
3           12        56  Hyderabad
4           67        78  Hyderabad
5           78        89    Chennai
6           89        78    Chennai

In [5]:
df['Temperature']=df['Temperature'].fillna(df['Temperature'].mean())
df

   Temperature  Humidity       city
0           34        50  Hyderabad
1           24        45  Hyderabad
2           34        36  Hyderabad
3           12        56  Hyderabad
4           67        78  Hyderabad
5           78        89    Chennai
6           89        78    Chennai

In [6]:
df['Humidity']=df['Humidity'].fillna(df['Humidity'].sum())
df

   Temperature  Humidity       city
0           34        50  Hyderabad
1           24        45  Hyderabad
2           34        36  Hyderabad
3           12        56  Hyderabad
4           67        78  Hyderabad
5           78        89    Chennai
6           89        78    Chennai

In [7]:
df.shape

(7, 3)

In [9]:
df.columns

Index(['Temperature', 'Humidity', 'city'], dtype='object')

In [10]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [11]:
df.dtypes

Temperature     int64
Humidity        int64
city           object
dtype: object

In [12]:
df.city

0    Hyderabad
1    Hyderabad
2    Hyderabad
3    Hyderabad
4    Hyderabad
5      Chennai
6      Chennai
Name: city, dtype: object

In [13]:
df.info

<bound method DataFrame.info of    Temperature  Humidity       city
0           34        50  Hyderabad
1           24        45  Hyderabad
2           34        36  Hyderabad
3           12        56  Hyderabad
4           67        78  Hyderabad
5           78        89    Chennai
6           89        78    Chennai>

In [14]:
df[2:6]

   Temperature  Humidity       city
2           34        36  Hyderabad
3           12        56  Hyderabad
4           67        78  Hyderabad
5           78        89    Chennai

# creating database

In [15]:
data=({
    "Name":["devs","Kavs","Vinay","Sri","Sai"],
    "Age": [12,23,45,67,23,23,12]
})
df

   Temperature  Humidity       city
0           34        50  Hyderabad
1           24        45  Hyderabad
2           34        36  Hyderabad
3           12        56  Hyderabad
4           67        78  Hyderabad
5           78        89    Chennai
6           89        78    Chennai

In [16]:
df.tail()

   Temperature  Humidity       city
2           34        36  Hyderabad
3           12        56  Hyderabad
4           67        78  Hyderabad
5           78        89    Chennai
6           89        78    Chennai

In [17]:
df.head()

   Temperature  Humidity       city
0           34        50  Hyderabad
1           24        45  Hyderabad
2           34        36  Hyderabad
3           12        56  Hyderabad
4           67        78  Hyderabad

In [18]:
df.dtypes

Temperature     int64
Humidity        int64
city           object
dtype: object

In [19]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Temperature  7 non-null      int64
 1   Humidity     7 non-null      int64
 2   city         7 non-null      object
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes

In [21]:
df[2:6]

   Temperature  Humidity       city
2           34        36  Hyderabad
3           12        56  Hyderabad
4           67        78  Hyderabad
5           78        89    Chennai

In [22]:
df.shape

(7, 3)